(function ($) {
    /* key: {..} */
    var data = {
        '111111': { 'name'     : '乾'
                  , 'guaci'    : '乾：元亨，利贞。'
                  , 'tuan'     : '大哉乾元，万物资始，乃统天。云行雨施，品物流形。大明始终，六位时成，时乘六龙以御天。乾道变化，各正性命，保合大和，乃利贞。首出庶物，万国咸宁。'
                  , 'yaoci'    : [ '初九：初九：潜龙，勿用。'
                                 , '九二：见龙在田，利见大人。'
                                 , '九三：九三：君子终日乾乾，夕惕若，厉，无咎。'
                                 , '九四：或跃在渊，无咎。'
                                 , '九五：飞龙在天，利见大人。'
                                 , '上九：亢龙有悔。'
                                 , '用九：见群龙无首，吉。'
                                 ]
                  , 'xiang'    : [ '天行健，君子以自强不息。'
                                 , '潜龙勿用，阳在下也。'
                                 , '见龙在田，德施普也。'
                                 , '终日乾乾，反复道也。'
                                 , '或跃在渊，进无咎也。'
                                 , '飞龙在天，大人造也。'
                                 , '亢龙有悔，盈不可久也。'
                                 , '用九，天德不可为首也。'
                                 ]
                  },

        '000000': { 'name'     : '坤'
                  , 'guaci'    : '坤：元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞，吉。'
                  , 'tuan'     : '至哉坤元，万物资生，乃顺承天。坤厚载物，德合无疆。含弘光大，品物咸亨。牝马地类，行地无疆，柔顺利贞。君子攸行，先迷失道，后顺得常。西南得朋，乃与类行；东北丧朋，乃终有庆。安贞之吉，应地无疆。'
                  , 'yaoci'    : [ '初六：履霜，坚冰至。'
                                 , '六二：直，方，大，不习无不利。'
                                 , '六三：含章可贞。或从王事，无成有终。'
                                 , '六四：括囊；无咎，无誉。'
                                 , '六五：黄裳，元吉。'
                                 , '上六：龙战于野，其血玄黄。'
                                 , '用六：利永贞。'
                                 ]
                  , 'xiang'    : [ '地势坤，君子以厚德载物。'
                                 , '履霜坚冰，阴始凝也。驯致其道，至坚冰也。'
                                 , '六二之动，直以方也。不习无不利，地道光也。'
                                 , '含章可贞；以时发也。或从王事，知光大也'
                                 , '括囊无咎，慎不害也。'
                                 , '黄裳元吉，文在中也。'
                                 , '战龙于野，其道穷也。'
                                 , '用六永贞，以大终也。'
                                 ]
                  },
        '010001': { 'name'     : '屯'
                  , 'guaci'    : '元亨，利贞，勿用有攸往，利建侯。'
                  , 'tuan'     : '屯，刚柔始交而难生，动乎险中，大亨贞。雷雨之动满盈，天造草昧，宜建侯而不宁。'
                  , 'yaoci'    : [ '初九：磐桓；利居贞，利建侯。'
                                 , '六二：屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。'
                                 , '六三：即鹿无虞，惟入于林中，君子几不如舍，往吝。'
                                 , '六四：乘马班如，求婚媾，往吉，无不利。'
                                 , '九五：屯其膏，小贞吉，大贞凶。'
                                 , '上六：乘马班如，泣血涟如。'
                                 ]
                  , 'xiang'    : [ '云，雷，屯；君子以经纶。'
                                 , '虽磐桓，志行正也。以贵下贱，大得民也。'
                                 , '六二之难，乘刚也。十年乃字，反常也。'
                                 , '即鹿无虞，以纵禽也。君子舍之，往吝穷也。'
                                 , '求而往，明也。'
                                 , '屯其膏，施未光也。'
                                 , '泣血涟如，何可长也。'
                                 ]
                  },

        '100010': { 'name'     : '蒙'
                  , 'guaci'    : '蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。'
                  , 'tuan'     : '蒙，山下有险，险而止，蒙。蒙亨，以亨行时中也。匪我求童蒙，童蒙求我，志应也。初噬告，以刚中也。再三渎，渎则不告，渎蒙也。蒙以养正，圣功也。'
                  , 'yaoci'    : [ '初六：发蒙，利用刑人，用说桎梏，以往吝。'
                                 , '九二：包蒙吉；纳妇吉；子克家。'
                                 , '六三：勿用娶女；见金夫，不有躬，无攸利。'
                                 , '六四：困蒙，吝。'
                                 , '六五：童蒙，吉。'
                                 , '上九：击蒙；不利为寇，利御寇。'
                                 ]
                  , 'xiang'    : [ '山下出泉，蒙；君子以果行育德。'
                                 , '利用刑人，以正法也。'
                                 , '子克家，刚柔接也。'
                                 , '勿用娶女，行不顺也。'
                                 , '困蒙之吝，独远实也。'
                                 , '童蒙之吉，顺以巽也。'
                                 , '利用御寇，上下顺也。'
                                 ]
                  },

        '000111': { 'name'     : '泰'
                  , 'guaci'    : '泰：小往大來，吉亨。'
                  , 'tuan'     : '泰，小往大來，吉亨。則是天地交，而萬物通也；上下交，而其志同也。內陽而外陰，內健而外順，內君子而外小人，君子道長，小人道消也。'
                  , 'yaoci'    : [ '初九：拔茅茹，以其彙，征吉。'
                                 , '九二：包荒，用馮河，不遐遺，朋亡，得尚于中行。'
                                 , '九三：无平不陂，无往不復，艱貞无咎。勿恤其孚，于食有福。'
                                 , '六四：翩翩，不富，以其鄰，不戒以孚。'
                                 , '六五：帝乙歸妹，以祉元吉。'
                                 , '上六：城復于隍，勿用師。自邑告命，貞吝。'
                                 ]
                  , 'xiang'    : [ '天地交泰，后以財成天地之道，輔相天地之宜，以左右民。'
                                 , '拔茅征吉，志在外也。'
                                 , '包荒，得尚于中行，以光大也。'
                                 , '无往不復，天地際也。'
                                 , '翩翩不富，皆失實也。不戒以孚，中心願也。'
                                 , '以祉元吉，中以行愿也。'
                                 , '城復于隍，其命亂也。'
                                 ]
                  }

    };

    $.yijing = $.yijing || {};
    $.yijing.datas = data;

})(jQuery)
