(function ($) {
    /* key: {..} */
    var data = {
        '111111': { 'name'     : '乾'
                  , 'guaci'    : '乾：元亨，利贞。'
                  , 'tuan'     : '大哉乾元，万物资始，乃统天。云行雨施，品物流形。大明始终，六位时成，时乘六龙以御天。乾道变化，各正性命，保合大和，乃利贞。首出庶物，万国咸宁。'
                  , 'yaoci'    : [ '初九：初九：潜龙，勿用。'
                                 , '九二：见龙在田，利见大人。'
                                 , '九三：九三：君子终日乾乾，夕惕若，厉，无咎。'
                                 , '九四：或跃在渊，无咎。'
                                 , '九五：飞龙在天，利见大人。'
                                 , '上九：亢龙有悔。'
                                 , '用九：见群龙无首，吉。'
                                 ]
                  , 'xiang'    : [ '天行健，君子以自强不息。'
                                 , '潜龙勿用，阳在下也。'
                                 , '见龙在田，德施普也。'
                                 , '终日乾乾，反复道也。'
                                 , '或跃在渊，进无咎也。'
                                 , '飞龙在天，大人造也。'
                                 , '亢龙有悔，盈不可久也。'
                                 , '用九，天德不可为首也。'
                                 ]
                  },

        '000000': { 'name'     : '坤'
                  , 'guaci'    : '坤：元亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞，吉。'
                  , 'tuan'     : '至哉坤元，万物资生，乃顺承天。坤厚载物，德合无疆。含弘光大，品物咸亨。牝马地类，行地无疆，柔顺利贞。君子攸行，先迷失道，后顺得常。西南得朋，乃与类行；东北丧朋，乃终有庆。安贞之吉，应地无疆。'
                  , 'yaoci'    : [ '初六：履霜，坚冰至。'
                                 , '六二：直，方，大，不习无不利。'
                                 , '六三：含章可贞。或从王事，无成有终。'
                                 , '六四：括囊；无咎，无誉。'
                                 , '六五：黄裳，元吉。'
                                 , '上六：龙战于野，其血玄黄。'
                                 , '用六：利永贞。'
                                 ]
                  , 'xiang'    : [ '地势坤，君子以厚德载物。'
                                 , '履霜坚冰，阴始凝也。驯致其道，至坚冰也。'
                                 , '六二之动，直以方也。不习无不利，地道光也。'
                                 , '含章可贞；以时发也。或从王事，知光大也'
                                 , '括囊无咎，慎不害也。'
                                 , '黄裳元吉，文在中也。'
                                 , '战龙于野，其道穷也。'
                                 , '用六永贞，以大终也。'
                                 ]
                  },
        '010001': { 'name'     : '屯'
                  , 'guaci'    : '元亨，利贞，勿用有攸往，利建侯。'
                  , 'tuan'     : '屯，刚柔始交而难生，动乎险中，大亨贞。雷雨之动满盈，天造草昧，宜建侯而不宁。'
                  , 'yaoci'    : [ '初九：磐桓；利居贞，利建侯。'
                                 , '六二：屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。'
                                 , '六三：即鹿无虞，惟入于林中，君子几不如舍，往吝。'
                                 , '六四：乘马班如，求婚媾，往吉，无不利。'
                                 , '九五：屯其膏，小贞吉，大贞凶。'
                                 , '上六：乘马班如，泣血涟如。'
                                 ]
                  , 'xiang'    : [ '云，雷，屯；君子以经纶。'
                                 , '虽磐桓，志行正也。以贵下贱，大得民也。'
                                 , '六二之难，乘刚也。十年乃字，反常也。'
                                 , '即鹿无虞，以纵禽也。君子舍之，往吝穷也。'
                                 , '求而往，明也。'
                                 , '屯其膏，施未光也。'
                                 , '泣血涟如，何可长也。'
                                 ]
                  },

        '100010': { 'name'     : '蒙'
                  , 'guaci'    : '蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。'
                  , 'tuan'     : '蒙，山下有险，险而止，蒙。蒙亨，以亨行时中也。匪我求童蒙，童蒙求我，志应也。初噬告，以刚中也。再三渎，渎则不告，渎蒙也。蒙以养正，圣功也。'
                  , 'yaoci'    : [ '初六：发蒙，利用刑人，用说桎梏，以往吝。'
                                 , '九二：包蒙吉；纳妇吉；子克家。'
                                 , '六三：勿用娶女；见金夫，不有躬，无攸利。'
                                 , '六四：困蒙，吝。'
                                 , '六五：童蒙，吉。'
                                 , '上九：击蒙；不利为寇，利御寇。'
                                 ]
                  , 'xiang'    : [ '山下出泉，蒙；君子以果行育德。'
                                 , '利用刑人，以正法也。'
                                 , '子克家，刚柔接也。'
                                 , '勿用娶女，行不顺也。'
                                 , '困蒙之吝，独远实也。'
                                 , '童蒙之吉，顺以巽也。'
                                 , '利用御寇，上下顺也。'
                                 ]
                  },

        '010111': { 'name'     : '需'
                  , 'guaci'    : '需：有孚，光亨，贞吉。利涉大川。'
                  , 'tuan'     : '需，须也；险在前也。刚健而不陷，其义不困穷矣。需有孚，光亨，贞吉。位乎天位，以正中也。利涉大川，往有功也。'
                  , 'yaoci'    : [ '初九：需于郊。利用恒，无咎。'
                                 , '九二：需于沙。小有言，终吉。'
                                 , '九三：需于泥，致寇至。'
                                 , '六四：需于血，出自穴。'
                                 , '九五：需于酒食，贞吉。'
                                 , '上六：入于穴，有不速之客三人来，敬之终吉。'
                                 ]
                  , 'xiang'    : [ '云上于天，需；君子以饮食宴乐。'
                                 , '需于郊，不犯难行也。利用恒，无咎；未失常也。'
                                 , '需于沙，衍在中也。虽小有言，以终吉也。'
                                 , '需于泥，灾在外也。自我致寇，敬慎不败也。'
                                 , '需于血，顺以听也。'
                                 , '酒食贞吉，以中正也。'
                                 , '不速之客来，敬之终吉。虽不当位，未大失也。'
                                 ]
                  },
        '111010': { 'name'     : '讼'
                  , 'guaci'    : '讼：有孚，窒。惕中吉。终凶。利见大人，不利涉大川。'
                  , 'tuan'     : '讼，上刚下险，险而健讼。讼有孚窒，惕中吉，刚来而得中也。终凶；讼不可成也。利见大人；尚中正也。不利涉大川；入于渊也。'
                  , 'yaoci'    : [ '初六：不永所事，小有言，终吉。'
                                 , '九二：不克讼，归而逋，其邑人三百户，无眚。'
                                 , '六三：食旧德，贞厉，终吉，或从王事，无成。'
                                 , '九四：不克讼，复即命渝，安贞吉。'
                                 , '九五：讼元吉。'
                                 , '上九：或锡之鞶带，终朝三褫之。'
                                 ]
                  , 'xiang'    : [ '天与水违行，讼；君子以作事谋始。'
                                 , '不永所事，讼不可长也。虽有小言，其辩明也。'
                                 , '不克讼，归而逋也。自下讼上，患至掇也。'
                                 , '食旧德，从上吉也。'
                                 , '复即命，渝安贞；不失也。'
                                 , '讼元吉，以中正也。'
                                 , '以讼受服，亦不足敬也。'
                                 ]
                  },

         '000010': { 'name'     : '师'
                  , 'guaci'    : '贞，丈人，吉无咎。'
                  , 'tuan'     : '师，众也，贞正也，能以众正，可以王矣。刚中而应，行险而顺，以此毒天下，而民从之，吉又何咎矣。'
                  , 'yaoci'    : [ '初六：师出以律，否臧凶。'
                                 , '九二：在师中吉，无咎，王三锡命。'
                                 , '六三：师或舆尸，凶。'
                                 , '六四：师左次，无咎。'
                                 , '六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。'
                                 , '上六：大君有命，开国承家，小人勿用。'
                                 ]
                  , 'xiang'    : [ '地中有水，师；君子以容民畜众。'
                                 , '师出以律，失律凶也。'
                                 , '在师中吉，承天宠也。王三锡命，怀万邦也。'
                                 , '师或舆尸，大无功也。'
                                 , '左次无咎，未失常也。'
                                 , '长子帅师，以中行也。弟子舆尸，使不当也。'
                                 , '大君有命，以正功也。小人勿用，必乱邦也。'
                                 ]
                  },
         '010000': { 'name'     : '比'
                  , 'guaci'    : '吉。原筮元永贞，无咎。不宁方来，后夫凶。'
                  , 'tuan'     : '比，吉也，比，辅也，下顺从也。原筮元永贞，无咎，以刚中也。不宁方来，上下应也。后夫凶，其道穷也。'
                  , 'yaoci'    : [ '初六：有孚，比之，无咎。有孚盈缶，终来有他，吉。'
                                 , '六二：比之自内，贞吉。'
                                 , '六三：比之匪人。'
                                 , '六四：外比之，贞吉。'
                                 , '九五：显比，王用三驱，失前禽。邑人不诫，吉。'
                                 , '上六：比之无首，凶。'
                                 ]
                  , 'xiang'    : [ '地上有水，比；先王以建万国，亲诸侯。'
                                 , '比之初六，有他吉也。'
                                 , '比之自内，不自失也。'
                                 , '比之匪人，不亦伤乎！'
                                 , '外比于贤，以从上也。'
                                 , '显比之吉，位正中也。舍逆取顺，失前禽也。邑人不诫，上使中也。'
                                 , '比之无首，无所终也。'
                                 ]
                  },
         '110111': { 'name'     : '小畜'
                  , 'guaci'    : '小畜：亨。密云不雨，自我西郊。'
                  , 'tuan'     : '小畜；柔得位，而上下应之，曰小畜。健而巽，刚中而志行，乃亨。密云不雨，尚往也。自我西郊，施未行也。'
                  , 'yaoci'    : [ '初九：复自道，何其咎，吉。'
                                 , '九二：牵复，吉。'
                                 , '九三：舆说辐，夫妻反目。'
                                 , '六四：有孚，血去惕出，无咎。'
                                 , '九五：有孚挛如，富以其邻。'
                                 , '上九：既雨既处，尚德载，妇贞厉。月几望，君子征凶。'
                                 ]
                  , 'xiang'    : [ '风行天上，小畜；君子以懿文德。'
                                 , '复自道，其义吉也。'
                                 , '牵复在中，亦不自失也。'
                                 , '夫妻反目，不能正室也。'
                                 , '有孚惕出，上合志也。'
                                 , '有孚挛如，不独富也。'
                                 , '既雨既处，德积载也。君子征凶，有所疑也。'
                                 ]
                  },

         '111011': { 'name'     : '履'
                  , 'guaci'    : '履虎尾，不咥人，亨。'
                  , 'tuan'     : '履，柔履刚也。说而应乎乾，是以履虎尾，不咥人，亨。刚中正，履帝位而不疚，光明也。'
                  , 'yaoci'    : [ '初九：素履，往无咎。'
                                 , '九二：履道坦坦，幽人贞吉。'
                                 , '六三：眇能视，跛能履，履虎尾，咥人，凶。武人为于大君。'
                                 , '九四：履虎尾，诉诉，终吉。'
                                 , '九五：夬履，贞厉。'
                                 , '上九：视履考祥，其旋元吉。'
                                 ]
                  , 'xiang'    : [ '上天下泽，履；君子以辨上下，安民志。'
                                 , '素履之往，独行愿也。'
                                 , '幽人贞吉，中不自乱也。'
                                 , '眇能视；不足以有明也。跛能履；不足以与行也，咥人之凶；位不当也。武人为于大君；志刚也。'
                                 , '诉诉终吉，志行也。'
                                 , '夬履贞厉，位正当也。'
                                 , '元吉在上，大有庆也。'
                                 ]
                  },

        '000111': { 'name'     : '泰'
                  , 'guaci'    : '泰：小往大來，吉亨。'
                  , 'tuan'     : '泰，小往大來，吉亨。則是天地交，而萬物通也；上下交，而其志同也。內陽而外陰，內健而外順，內君子而外小人，君子道長，小人道消也。'
                  , 'yaoci'    : [ '初九：拔茅茹，以其彙，征吉。'
                                 , '九二：包荒，用馮河，不遐遺，朋亡，得尚于中行。'
                                 , '九三：无平不陂，无往不復，艱貞无咎。勿恤其孚，于食有福。'
                                 , '六四：翩翩，不富，以其鄰，不戒以孚。'
                                 , '六五：帝乙歸妹，以祉元吉。'
                                 , '上六：城復于隍，勿用師。自邑告命，貞吝。'
                                 ]
                  , 'xiang'    : [ '天地交泰，后以財成天地之道，輔相天地之宜，以左右民。'
                                 , '拔茅征吉，志在外也。'
                                 , '包荒，得尚于中行，以光大也。'
                                 , '无往不復，天地際也。'
                                 , '翩翩不富，皆失實也。不戒以孚，中心願也。'
                                 , '以祉元吉，中以行愿也。'
                                 , '城復于隍，其命亂也。'
                                 ]
                  },
         '111000': { 'name'     : '否'
                  , 'guaci'    : '否之匪人，不利君子贞，大往小来。'
                  , 'tuan'     : '否之匪人，不利君子贞。大往小来，则是天地不交，而万物不通也；上下不交，而天下无邦也。内阴而外阳，内柔而外刚，内小人而外君子。小人道长，君子道消也。'
                  , 'yaoci'    : [ '初六：拔茅茹，以其汇，贞吉亨。'
                                 , '六二：包承。小人吉，大人否，亨。'
                                 , '六三：包羞。'
                                 , '九四：有命，无咎，畴离祉。'
                                 , '九五：休否，大人吉。其亡其亡，系于苞桑。'
                                 , '上九：倾否，先否后喜。'
                                 ]
                  , 'xiang'    : [ '天地不交，否；君子以俭德辟难，不可荣以禄。'
                                 , '拔茅贞吉，志在君也。'
                                 , '大人否亨，不乱群也。'
                                 , '包羞，位不当也。'
                                 , '有命无咎，志行也。'
                                 , '大人之吉，位正当也。'
                                 , '否终则倾，何可长也。'
                                 ]
                  },

         '111101': { 'name'     : '同人'
                  , 'guaci'    : '同人于野，亨。利涉大川，利君子贞。'
                  , 'tuan'     : '同人，柔得位得中，而应乎乾，曰同人。同人曰，同人于野，亨。利涉大川，乾行也。文明以健，中正而应，君子正也。唯君子为能通天下之志。'
                  , 'yaoci'    : [ '初九：同人于门，无咎。'
                                 , '六二：同人于宗，吝。'
                                 , '九三：伏戎于莽，升其高陵，三岁不兴。'
                                 , '九四：乘其墉，弗克攻，吉。'
                                 , '九五：同人，先号啕而后笑。大师克相遇。'
                                 , '上九：同人于郊，无悔。'
                                 ]
                  , 'xiang'    : [ '天与火，同人；君子以类族辨物。'
                                 , '出门同人，又谁咎也。'
                                 , '同人于宗，吝道也。'
                                 , '伏戎于莽，敌刚也。三岁不兴，安行也。'
                                 , '乘其墉，义弗克也，其吉，则困而反则也。  '
                                 , '同人之先，以中直也。大师相遇，言相克也。'
                                 , '同人于郊，志未得也。'
                                 ]
                  },
         '101111': { 'name'     : '大有'
                  , 'guaci'    : '大有：元亨。'
                  , 'tuan'     : '大有，柔得尊位，大中而上下应之，曰大有。其德刚健而文明，应乎天而时行，是以元亨。'
                  , 'yaoci'    : [ '初九：无交害，匪咎，艰则无咎。'
                                 , '六二：同人于宗，吝。'
                                 , '九三：公用亨于天子，小人弗克。'
                                 , '九四：匪其彭，无咎。'
                                 , '六五：厥孚交如，威如；吉。'
                                 , '上九：自天佑之，吉无不利。'
                                 ]
                  , 'xiang'    : [ '火在天上，大有；君子以遏恶扬善，顺天休命。'
                                 , '大有初九，无交害也。'
                                 , '大车以载，积中不败也。'
                                 , '公用亨于天子，小人害也。'
                                 , '匪其彭，无咎；明辨晰也。'
                                 , '厥孚交如，信以发志也。威如之吉，易而无备也。'
                                 , '大有上吉，自天佑也。'
                                 ]
                  },
         '000100': { 'name'     : '谦'
                  , 'guaci'    : '谦：亨，君子有终。'
                  , 'tuan'     : '谦，亨，天道下济而光明，地道卑而上行。天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦。谦尊而光，卑而不可逾，君子之终也。'
                  , 'yaoci'    : [ '初六：谦谦君子，用涉大川，吉。'
                                 , '六二：鸣谦，贞吉。'
                                 , '九三：劳谦，君子有终，吉。'
                                 , '六四：无不利，撝谦。'
                                 , '六五：不富，以其邻，利用侵伐，无不利。'
                                 , '上六：鸣谦，利用行师，征邑国。'
                                 ]
                  , 'xiang'    : [ '地中有山，谦；君子以裒多益寡，称物平施。'
                                 , '谦谦君子，卑以自牧也。'
                                 , '鸣谦贞吉，中心得也。'
                                 , '劳谦君子，万民服也。'
                                 , '无不利，撝谦；不违则也。'
                                 , '利用侵伐，征不服也。'
                                 , '鸣谦，志未得也。可用行师，征邑国也。'
                                 ]
                  },
         '001000': { 'name'     : '豫'
                  , 'guaci'    : '豫：利建侯，行师。'
                  , 'tuan'     : '豫，刚应而志行，顺以动，豫。豫，顺以动，故天地如之，而况建侯行师乎？天地以顺动，故日月不过，而四时不忒；圣人以顺动，则刑罚清而民服。豫之时义大矣哉！'
                  , 'yaoci'    : [ '初六：鸣豫，凶。'
                                 , '六二：介于石，不终日，贞吉。'
                                 , '六三：盱豫，悔。迟有悔。'
                                 , '九四：由豫，大有得。勿疑。朋盍簪。'
                                 , '六五：贞疾，恒不死。'
                                 , '上六：冥豫，成有渝，无咎。'
                                 ]
                  , 'xiang'    : [ '雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。'
                                 , '初六鸣豫，志穷凶也。'
                                 , '不终日，贞吉；以中正也。'
                                 , '盱豫有悔，位不当也。'
                                 , '由豫，大有得；志大行也。'
                                 , '六五贞疾，乘刚也。恒不死，中未亡也。'
                                 , '冥豫在上，何可长也。'
                                 ]
                  },
         '011001': { 'name'     : '随'
                  , 'guaci'    : '随：元亨利贞，无咎。'
                  , 'tuan'     : '随，刚来而下柔，动而说，随。大亨贞，无咎，而天下随时，随之时义大矣哉！'
                  , 'yaoci'    : [ '初九：官有渝，贞吉。出门交有功。'
                                 , '六二：系小子，失丈夫。'
                                 , '六三：系丈夫，失小子。随有求得，利居贞。'
                                 , '九四：随有获，贞凶。有孚在道，以明，何咎。'
                                 , '九五：孚于嘉，吉。'
                                 , '上六：拘系之，乃从维之。王用亨于西山。'
                                 ]
                  , 'xiang'    : [ '泽中有雷，随；君子以向晦入宴息。'
                                 , '官有渝，从正吉也。出门交有功，不失也。'
                                 , '系小子，弗兼与也。'
                                 , '系丈夫，志舍下也。'
                                 , '随有获，其义凶也。有孚在道，明功也。'
                                 , '孚于嘉，吉；位正中也。'
                                 , '拘系之，上穷也。'
                                 ]
                  },
         '100110': { 'name'     : '蛊'
                  , 'guaci'    : '蛊：元亨，利涉大川。先甲三日，后甲三日。'
                  , 'tuan'     : '蛊，刚上而柔下，巽而止，蛊。蛊，元亨，而天下治也。利涉大川，往有事也。先甲三日，后甲三日，终则有始，天行也。'
                  , 'yaoci'    : [ '初六：干父之蛊，有子，考无咎，厉终吉。'
                                 , '九二：干母之蛊，不可贞。'
                                 , '九三：干父之蛊，小有悔，无大咎。'
                                 , '六四：裕父之蛊，往见吝。'
                                 , '六五：干父之蛊，用誉。'
                                 , '上九：不事王侯，高尚其事。'
                                 ]
                  , 'xiang'    : [ '山下有风，蛊；君子以振民育德。'
                                 , '干父之蛊，意承考也。'
                                 , '干母之蛊，得中道也。'
                                 , '干父之蛊，终无咎也。'
                                 , '裕父之蛊，往未得也。'
                                 , '干父之蛊；承以德也。'
                                 , '不事王侯，志可则也。'
                                 ]
                  },
         '000011': { 'name'     : '临'
                  , 'guaci'    : '临：元，亨，利，贞。至于八月有凶。'
                  , 'tuan'     : '临，刚浸而长。说而顺，刚中而应，大亨以正，天之道也。至于八月有凶，消不久也。'
                  , 'yaoci'    : [ '初九：咸临，贞吉。'
                                 , '九二：咸临，吉无不利。'
                                 , '六三：甘临，无攸利。既忧之，无咎。'
                                 , '六四：至临，无咎。'
                                 , '六五：知临，大君之宜，吉。'
                                 , '上六：敦临，吉无咎。'
                                 ]
                  , 'xiang'    : [ '泽上有地，临；君子以教思无穷，容保民无疆。'
                                 , '咸临贞吉，志行正也。'
                                 , '咸临，吉无不利；未顺命也。'
                                 , '甘临，位不当也。既忧之，咎不长也。'
                                 , '至临无咎，位当也。'
                                 , '大君之宜，行中之谓也。'
                                 , '敦临之吉，志在内也。'
                                 ]
                  },
         '110000': { 'name'     : '观'
                  , 'guaci'    : '观：盥而不荐，有孚顒若。'
                  , 'tuan'     : '大观在上，顺而巽，中正以观天下。观，盥而不荐，有孚顒若，下观而化也。观天之神道，而四时不忒，圣人以神道设教，而天下服矣。'
                  , 'yaoci'    : [ '初六：童观，小人无咎，君子吝。'
                                 , '六二：窥观，利女贞。'
                                 , '六三：观我生，进退。'
                                 , '六四：观国之光，利用宾于王。'
                                 , '九五：观我生，君子无咎。'
                                 , '上九：观其生，君子无咎。'
                                 ]
                  , 'xiang'    : [ '风行地上，观；先王以省方，观民设教。'
                                 , '初六童观，小人道也。'
                                 , '窥观女贞，亦可丑也。'
                                 , '观我生，进退；未失道也。'
                                 , '观国之光，尚宾也。'
                                 , '观我生，观民也。'
                                 , '观其生，志未平也。'
                                 ]
                  },
         '101001': { 'name'     : '噬嗑'
                  , 'guaci'    : '噬嗑：亨。利用狱。'
                  , 'tuan'     : '颐中有物，曰噬嗑，噬嗑而亨。刚柔分，动而明，雷电合而章。柔得中而上行，虽不当位，利用狱也。'
                  , 'yaoci'    : [ '初九：屦校灭趾，无咎。'
                                 , '六二：噬肤灭鼻，无咎。'
                                 , '六三：噬腊肉，遇毒；小吝，无咎。'
                                 , '九四：噬乾胏，得金矢，利艰贞，吉。'
                                 , '六五：噬乾肉，得黄金，贞厉，无咎。'
                                 , '上九：何校灭耳，凶。'
                                 ]
                  , 'xiang'    : [ '雷电噬嗑；先王以明罚敕法。'
                                 , '屦校灭趾，不行也。'
                                 , '噬肤灭鼻，乘刚也。'
                                 , '遇毒，位不当也。'
                                 , '利艰贞吉，未光也。'
                                 , '贞厉无咎，得当也。'
                                 , '何校灭耳，聪不明也。'
                                 ]
                  },
         '100101': { 'name'     : '贲'
                  , 'guaci'    : '贲：亨。小利有攸往。'
                  , 'tuan'     : '贲，亨；柔来而文刚，故亨。分刚上而文柔，故小利有攸往。天文也；文明以止，人文也。观乎天文，以察时变；观乎人文，以化成天下。'
                  , 'yaoci'    : [ '初九：贲其趾，舍车而徒。'
                                 , '六二：贲其须。'
                                 , '九三：贲如濡如，永贞吉。'
                                 , '六四：贲如皤如，白马翰如，匪寇婚媾。'
                                 , '六五：贲于丘园，束帛戋戋，吝，终吉。'
                                 , '上九：白贲，无咎。'
                                 ]
                  , 'xiang'    : [ '山下有火，贲；君子以明庶政，无敢折狱。'
                                 , '舍车而徒，义弗乘也。'
                                 , '贲其须，与上兴也。'
                                 , '永贞之吉，终莫之陵也。'
                                 , '六四，当位疑也。匪寇婚媾，终无尤也。'
                                 , '六五之吉，有喜也。'
                                 , '白贲无咎，上得志也。'
                                 ]
                  },
         '000001': { 'name'     : '复'
                  , 'guaci'    : '复：亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。'
                  , 'tuan'     : '复亨；刚反，动而以顺行，是以出入无疾，朋来无咎。反复其道，七日来复，天行也。利有攸往，刚长也。复其见天地之心乎？'
                  , 'yaoci'    : [ '初九：不复远，无祗悔，元吉。'
                                 , '六二：休复，吉。'
                                 , '六三：频复，厉无咎。'
                                 , '六四：中行独复。'
                                 , '六五：敦复，无悔。'
                                 , '上六：迷复，凶，有灾眚。用行师，终有大败，以其国君，凶；至于十年，不克征。'
                                 ]
                  , 'xiang'    : [ '雷在地中，复；先王以至日闭关，商旅不行，后不省方。'
                                 , '不远之复，以修身也。'
                                 , '休复之吉，以下仁也。'
                                 , '频复之厉，义无咎也。'
                                 , '中行独复，以从道也。'
                                 , '敦复无悔，中以自考也。'
                                 , '迷复之凶，反君道也。'
                                 ]
                  },
         '111001': { 'name'     : '无妄'
                  , 'guaci'    : '无妄：元亨，利贞。其匪正有眚，不利有攸往。'
                  , 'tuan'     : '无妄，刚自外来，而为主于内。动而健，刚中而应，大亨以正，天之命也。其匪正有眚，不利有攸往。无妄之往，何之矣？天命不佑，行矣哉？'
                  , 'yaoci'    : [ '初九：无妄，往吉。'
                                 , '六二：不耕获，不灾畲，则利有攸往。'
                                 , '六三：无妄之灾，或系之牛，行人之得，邑人之灾。'
                                 , '九四：可贞，无咎。'
                                 , '九五：无妄之疾，勿药有喜。'
                                 , '上九：无妄，行有眚，无攸利。'
                                 ]
                  , 'xiang'    : [ '天下雷行，物与无妄；先王以茂对时，育万物。'
                                 , '无妄之往，得志也。'
                                 , '不耕获，未富也。'
                                 , '行人得牛，邑人灾也。'
                                 , '可贞无咎，固有之也。'
                                 , '无妄之药，不可试也。'
                                 , '无妄之行，穷之灾也。'
                                 ]
                  },
         '100111': { 'name'     : '大畜'
                  , 'guaci'    : '大畜：利贞，不家食吉，利涉大川。'
                  , 'tuan'     : '大畜，刚健笃实辉光，日新其德，刚上而尚贤。能止健，大正也。不家食吉，养贤也。利涉大川，应乎天也。'
                  , 'yaoci'    : [ '初九：有厉利已。'
                                 , '九二：舆说輹。'
                                 , '九三：良马逐，利艰贞。曰闲舆卫，利有攸往。'
                                 , '六四：童牛之牿，元吉。'
                                 , '六五：豶豕之牙，吉。'
                                 , '上九：何天之衢，亨。'
                                 ]
                  , 'xiang'    : [ '天在山中，大畜；君子以多识前言往行，以畜其德。'
                                 , '有厉利已，不犯灾也。'
                                 , '舆说輹，中无尤也。'
                                 , '利有攸往，上合志也。'
                                 , '六四元吉，有喜也。'
                                 , '六五之吉，有庆也。'
                                 , '何天之衢，道大行也。'
                                 ]
                  },
         '100001': { 'name'     : '颐'
                  , 'guaci'    : '颐：贞吉。观颐，自求口实。'
                  , 'tuan'     : '颐贞吉，养正则吉也。观颐，观其所养也；自求口实，观其自养也。天地养万物，圣人养贤，以及万民；颐之时义大矣哉！'
                  , 'yaoci'    : [ '初九：舍尔灵龟，观我朵颐，凶。'
                                 , '六二：颠颐，拂经，于丘颐，征凶。'
                                 , '六三：拂颐，贞凶，十年勿用，无攸利。'
                                 , '六四：颠颐，吉，虎视眈眈，其欲逐逐，无咎。'
                                 , '六五：拂经，居贞吉，不可涉大川。'
                                 , '上九：由颐，厉吉，利涉大川。'
                                 ]
                  , 'xiang'    : [ '山下有雷，颐；君子以慎言语，节饮食。'
                                 , '观我朵颐，亦不足贵也。'
                                 , '六二征凶，行失类也。'
                                 , '十年勿用，道大悖也。'
                                 , '颠颐之吉，上施光也。'
                                 , '居贞之吉，顺以从上也。'
                                 , '由颐厉吉，大有庆也。'
                                 ]
                  },
         '011110': { 'name'     : '大过'
                  , 'guaci'    : '大过：栋桡，利有攸往，亨。'
                  , 'tuan'     : '大过，大者过也。栋桡，本末弱也。刚过而中，巽而说行，利有攸往，乃亨。大过之时义大矣哉！'
                  , 'yaoci'    : [ '初六：藉用白茅，无咎。'
                                 , '九二：枯杨生稊，老夫得其女妻，无不利。'
                                 , '九三：栋桡，凶。'
                                 , '九四：栋隆，吉；有它吝。'
                                 , '九五：枯杨生华，老妇得士夫，无咎无誉。'
                                 , '上六：过涉灭顶，凶，无咎。'
                                 ]
                  , 'xiang'    : [ '泽灭木，大过；君子以独立不惧，遯世无闷。'
                                 , '藉用白茅，柔在下也。'
                                 , '老夫女妻，过以相与也。'
                                 , '栋桡之凶，不可以有辅也。'
                                 , '栋隆之吉，不桡乎下也。'
                                 , '枯杨生华，何可久也。老妇士夫，亦可丑也。'
                                 , '过涉之凶，不可咎也。'
                                 ]
                  },
         '010010': { 'name'     : '坎'
                  , 'guaci'    : '坎：习坎，有孚，维心亨，行有尚。'
                  , 'tuan'     : '习坎，重险也。水流而不盈，行险而不失其信。维心亨，乃以刚中也。行有尚，往有功也。天险不可升也，地险山川丘陵也，王公设险以守其国，坎之时用大矣哉！'
                  , 'yaoci'    : [ '初六：习坎，入于坎窞，凶。'
                                 , '九二：坎有险，求小得。'
                                 , '六三：来之坎坎，险且枕，入于坎窞，勿用。'
                                 , '六四：樽酒簋贰，用缶，纳约自牖，终无咎。'
                                 , '九五：坎不盈，祗既平，无咎。'
                                 , '上六：系用徽纆，置于丛棘，三岁不得，凶。'
                                 ]
                  , 'xiang'    : [ '水洊至，习坎；君子以常德行，习教事。'
                                 , '习坎入坎，失道凶也。'
                                 , '求小得，未出中也。'
                                 , '来之坎坎，终无功也。'
                                 , '樽酒簋贰，刚柔际也。'
                                 , '坎不盈，中未大也。'
                                 , '上六失道，凶三岁也。'
                                 ]
                  },
         '101101': { 'name'     : '离'
                  , 'guaci'    : '离：利贞，亨。畜牝牛，吉。'
                  , 'tuan'     : '离，丽也；日月丽乎天，百谷草木丽乎土，重明以丽乎正，乃化成天下。柔丽乎中正，故亨；是以畜牝牛吉也。'
                  , 'yaoci'    : [ '初九：履错然，敬之无咎。'
                                 , '六二：黄离，元吉。'
                                 , '九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。'
                                 , '九四：突如其来如，焚如，死如，弃如。'
                                 , '六五：出涕沱若，戚嗟若，吉。'
                                 , '上九：王用出征，有嘉折首，获匪其丑，无咎。'
                                 ]
                  , 'xiang'    : [ '明两作离，大人以继明照于四方。'
                                 , '履错之敬，以辟咎也。'
                                 , '黄离元吉，得中道也。'
                                 , '日昃之离，何可久也。'
                                 , '突如其来如，无所容也。'
                                 , '六五之吉，离王公也。'
                                 , '王用出征，以正邦也。'
                                 ]
                  },
    };

    /* use list to key order easily */
    var xianTian8Gua = [
         {
            'key': '111',
            'name': '乾',
            'alias': '天'
         }, 
         {  'key': '011',
            'name': '兑',
            'alias': '泽'
         }, 
         {  'key': '101',
            'name': '离',
            'alias': '火'
         }, 
         {  'key': '001',
            'name': '震',
            'alias': '雷'
         }, 
         {  'key': '110',
            'name': '巽',
            'alias': '风'
         }, 
         {  'key': '010',
            'name': '坎',
            'alias': '水'
         }, 
         {  'key': '100',
            'name': '艮',
            'alias': '山'
         }, 
         {  'key': '000',
            'name': '坤',
            'alias': '地'
         }

    ];
    $.yijing = $.yijing || {};
    // 64 Gua
    $.yijing.datas = data;
    // xian tian 8 gua
    $.yijing.xianTian8Gua = xianTian8Gua;

})(jQuery)
